<html>
    <head><title>Лабораторная работа 3.2</title></head>
<body>
    <div><h3>Вариант 10.	200 л бензину потрібно розлити у баки місткістю 60, 45 і 25 літрів. <br>Отримати всі можливі варіанти розливу. <br>Підрахувати їхню кількість..</h3></div>
<?
    $answer=0;
	for ($i=0; $i<=3; $i++)
        for($j=0; $j<=4; $j++)
            for($l=0; $l<=8; $l++)
            {
                if($i*65+$j*45+$l*25 == 200)
                {
                    echo "Баков по 65л: $i Баков по 45л: $j Баков по 25л: $l<br>" ;
                    $answer++;
                };
            };
    echo "<p>Ответ: $answer<p>";
?>
    </body>
</html>